In [3]:
import numpy as np
import pandas as pd
import gmaps

# Google developer API key
from config import gkey

In [11]:
# read previous outputs into new dataframes
toronto_schools = pd.read_csv("output_data/toronto_schools.csv")
catholic_schools = pd.read_csv("output_data/toronto_catholic_schools.csv")

In [21]:
top_ts=toronto_schools.nlargest(10,"RATINGS")[["SCHOOL NAME","FSA","RATINGS"]]
top_cs=catholic_schools.nlargest(10,"RATINGS")[["SCHOOL NAME","FSA","RATINGS"]]

In [22]:
# Visualize top 10 Toronto Schools
top_ts

               SCHOOL NAME  FSA  RATINGS
11                 Fleming  M1B      9.5
166                Whitney  M4T      9.5
129                 Denlow  M3B      9.3
164    John Ross Robertson  M4R      9.3
245  Humber Valley Village  M9A      9.3
115           Beverly Glen  M1W      9.2
163              Blythwood  M4N      9.1
211  Ossington/Old Orchard  M6J      9.1
233                Swansea  M6S      9.1
88                Iroquois  M1S      9.0

In [24]:
# Visualize top 10 Catholic Schools
top_cs

                    SCHOOL NAME  FSA  RATINGS
104                St Sebastian  M6H     10.0
84           St Michael's Choir  M5B      8.8
132       Josyf Cardinal Slipyj  M9B      8.8
133                  St Clement  M9C      8.8
56               St Bonaventure  M3C      8.7
81   Our Lady of Perpetual Help  M4T      8.6
141                St Demetrius  M9P      8.4
35              Prince of Peace  M1V      8.3
40                     St Henry  M1W      8.3
122                 St Josaphat  M8V      8.3

In [28]:
# read output house prices into new dataframe
house_price=pd.read_csv("output_data/toronto_api_postal_combined and filtered with price range 100K to 10M.csv")
house_price.head()

,Index,AreaName,Price ($),lat,lng,Address,City,Postal Code,FSA
0,1,Downtown,100000,43.669567,-79.388596,#13 - 55 Bloor St,Toronto,M4W 1A6,M4W
1,2,Emery,102000,43.749187,-79.542702,#704 - 3390 Weston Rd,Toronto,M9M 2X3,M9M
2,3,Emery,104900,43.749187,-79.542702,#1104 - 3390 WESTON RD,Toronto,M9M 2X3,M9M
3,4,Mimico,105000,43.615341,-79.492996,170 THE QUEENS WAY,Toronto,M8V 2N9,M8V
4,5,Mimico,105000,43.615341,-79.492996,170 THE QUEENS WAY,Toronto,M8V 2N9,M8V

In [54]:
top_ts_list=list(top_ts["FSA"])
# top_cs_list=list(top_cs["FSA"])
# ts_house_price=[]
# for fsa in top_ts_list:
ts_house_price=house_price[house_price["FSA"].isin(top_ts_list)]

ts_house_price["FSA"].value_counts()

M1B    95
M1S    92
M6S    71
M6J    67
M1W    63
M9A    51
M4N    32
M3B    22
M4R    10
M4T    10
Name: FSA, dtype: int64